[{
    "name": "Myles Borins",
    "twitter": "MylesBorins",
    "github": "mylesborins",
    "portrait": "myles.jpeg",
    "bio": "Artist, Musician, Developer, and Inventor. @nodejs CTC",
    "talk": "Node.js Releases, how do they work?",
    "abstract": "Node.js is growing up, and with that comes the responsibility of proper legacy support. As of Node.js Argon (v4.2.0) there is an official Long Term Support release cycle that lasts for 30 months!\n\nHow does a project moving at the pace of node maintain multiple release lines? How does a commit get backported? How is a release actually made?\nYou will learn all this and more on this weeks episode of \"Node.js Releases, how do they work?\".\nI work as a full time Node.js contributor for IBM. Currently I am one of the individuals in the trenches back porting commits. If you are using an LTS version of node, there is a decent likely hood that I released it.\n\nRelease management is a very interesting art, and I would love the opportunity to pull the curtains back a bit on the process of how code lands into a project like node, and the kind of edge cases created when wrangling such a repo."
  },
  {
    "name": "Bryan English",
    "twitter": "bengl",
    "github": "bengl",
    "portrait": "bryan.jpeg",
    "bio": "Ottawan in SF. @nodejs at Intrinsic. previously Yahoo. Democracy-exempt.",
    "talk": "Signet: Safely Curl Pipe Bash. No Seriously!",
    "abstract": "Signet is an answer to “How can we curl to bash with some measure of safety and authenticity?” taking a different approach from normal signatures. It’s meant to be an addon to existing package management tooling. It’s platform and language agnostic, and it’s made in node.js!"
  },
  {
    "name": "William Kapke",
    "twitter": "williamkapke",
    "github": "williamkapke",
    "portrait": "william.jpeg",
    "bio": "Node.js Board of Directors, Consultant, node.green creator. Previously Tinder, MySpace",
    "talk": "The Node.js Organization: Behind the scenes",
    "abstract": "Node.js is one of the most active Organizations on GitHub. There are over 500 contributors working together to constantly crank out new versions and updates to existing ones. Hundreds of comments, issues, and pull requests are generated and resolved every month by a very diverse group of volunteers.\n\nSo, how do we pull it off?\n\nIn this talk, I will give a tour of The Node.js Foundation Committees, Working Groups, Teams and Github repositories. I'll explain why they exist, how they were created, who runs them... and how **you** can join in!"
  }]
